quest_system_94070461_name=^?^Miner's Strike
quest_system_94070461_stage_0=^?^The dwarven miners ask that you deliver their petition to the king, Torn Digor.
quest_system_94070461_stage_1=^?^Torn Digor has agreed to the demands of the dwarven miners.
quest_system_94070461_task=^?^Miners from the settlement Datron have gone on a strike to demand that the workweek be shortened to 50 hours, on account of the war with the demons.<br>[reward]
